Documents/Renault_АктПоКредитам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_АктПоКредитам</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыАктовКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыданныеКредиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КредитныеПредложения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКредита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодписанияДоговора</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_КартинкиИФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КартинкиИФайлы</Name>
			<Comment>Универсальный том хранилищ дополнительных данных</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Исходное имя файла для сохранения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Comment>Дата сохранения данных объекта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Comment>Исходный размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к файлу / картинке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Comment>Хранилище данных картинки или файла</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеВоВнешнемФайле</Name>
					<Comment>Признак того, что данные храняться во внешнем файле</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Comment>Признак того, что файл являеться картинкой</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПоЭлектроннойПочте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник) для которого необходимо реализовать хренение некоторых данных (например картинок)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификационная строка, разделяющая данные объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СведенияКомпании</Name>
			<Comment>Некоторые сведения о компании которые могут измениться со временем (например гл. бухгалтер, руководитель...)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение сведения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоСтатусам</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоДатам</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Вид сведения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСведений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_СтатусыАктовКредитования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СтатусыАктовКредитования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_СтатусыДоговоровНаПродажуАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыДоговоровНаПродажуАвтомобиля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасторжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИзменение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_СпособыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СпособыОплаты</Name>
			<Comment>Способ оплаты</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаличнаяОплата</Name>
					<Comment>Наличная оплата чека</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналичнаяОплата</Name>
					<Comment>Безналичная оплата чека</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеноКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналЛизинг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
					<Comment>Шины</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диски</Name>
					<Comment>Диски</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерныеАгрегаты</Name>
					<Comment>Номерные агрегаты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛКМ</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опции</Name>
					<Comment>Опции автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автомобили</Name>
					<Comment>Автомобили</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыРаспределенияДопРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыРаспределенияДопРасходов</Name>
			<Comment>Способы распределения суммы по строкам номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСумме</Name>
					<Comment>Распределение на себестоимость по сумме</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличеству</Name>
					<Comment>Распределение на себестоимость по количеству</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВесу</Name>
					<Comment>Распределение на себестоимость по весу</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДоходыИРасходы</Name>
					<Comment>Без распределения на себестоимость</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_АктПоКредитам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		//ОбщийДляДокументов.ЗаполнитьНовыйДокумент(Объект, ПараметрыСеанса.ТекущийПользователь);
		Объект.Автор=ПараметрыСеанса.Пользователь;
		Объект.Организация=ПараметрыСеанса.Организация;
		Объект.Статус = Перечисления.Renault_СтатусыАктовКредитования.ВРаботе;
	КонецЕсли;
	
	Если Отказ Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	Форма=ПолучитьФорму("РегистрСведений.Renault_КартинкиИФайлы.Форма.ФормаСписка");
	Форма.Отбор.Объект.Значение=Объект.Ссылка;
	Форма.Отбор.Объект.Использование=Истина;
	Форма.Отбор.Объект.ВидСравнения=ВидСравнения.Равно;
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКредитами(Команда)
	
	Если Объект.ВыданныеКредиты.Количество() Тогда
		Ответ = Вопрос("Табличная часть документа будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,60);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			Объект.ВыданныеКредиты.Очистить();
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация)Тогда
		Сообщить("Заполните реквизит ""Организация""!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Банк)Тогда
		Сообщить("Заполните реквизит ""Банк""!");
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Объект.ПериодС) Тогда 
		Сообщить("Заполните реквизит ""Период с""!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПериодПо) Тогда 
		Сообщить("Заполните реквизит ""Период по""!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧ();
	
	ОбновитьИтого();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_Договор.Клиент,
	|	Renault_Договор.КредитнаяПрограмма КАК Продукт,
	|	Renault_Договор.СуммаКредита,
	|	Renault_Договор.ДатаКредитногоДоговора КАК ДатаПодписанияДоговора,
	|	Renault_Договор.Ссылка КАК Договор
	|ИЗ
	|	Документ.Renault_Договор КАК Renault_Договор
	|ГДЕ
	|	Renault_Договор.ДатаКредитногоДоговора МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Renault_Договор.КредитнаяПрограмма.Владелец = &Плательщик
	|	И ВЫБОР
	|			КОГДА &ОтборПоВсемОрганизациям
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_Договор.Организация = &Организация
	|		КОНЕЦ
	|	И Renault_Договор.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан)
	|	И Renault_Договор.СпособОплаты В (ЗНАЧЕНИЕ(Перечисление.Renault_СпособыОплаты.Кредит), ЗНАЧЕНИЕ(Перечисление.Renault_СпособыОплаты.РеноКредит))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_Договор.ДатаКредитногоДоговора";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Плательщик", Объект.Банк);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодС);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ПериодПо);
	Запрос.УстановитьПараметр("ОтборПоВсемОрганизациям", Объект.ПоВсемОрганизациям);
	
	Объект.ВыданныеКредиты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчета(Команда)
	
	Если Объект.Статус <> Перечисления.Renault_СтатусыАктовКредитования.Согласован Тогда 
		Предупреждение("Счет печатается только из документа в статусе ""Согласован""!", 15);
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		Если ЭтаФорма.Модифицированность = Ложь Тогда
			ТабДок = СформироватьМакетСчет();
			ТабДок.Показать();
		Иначе Сообщить("Документ был изменен! Сохраните его.", СтатусСообщения.Важное);
		КонецЕсли;	
	Иначе Сообщить("Документ должен быть проведен!", СтатусСообщения.ОченьВажное);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьМакетСчет()
	
	Если ЗначениеЗаполнено(Объект.СчетНаОплату) Тогда
		ДокументСчет = Объект.СчетНаОплату.ПолучитьОбъект();
		ДокументСчет.Товары.Очистить();
	Иначе
		ДокументСчет = Документы.СчетНаОплату.СоздатьДокумент();
	КонецЕсли;
   	ДокументСчет.Дата					 = Объект.Дата;	
	ДокументСчет.Организация 		     = Объект.Организация;
	ДокументСчет.РасчетныйСчетОрганизации= ДокументСчет.Организация.ОсновнойБанковскийСчет;
	ДокументСчет.Контрагент 			 = Объект.Контрагент;
	ДокументСчет.ДоговорВзаиморасчетов	 = Объект.ДоговорВзаиморасчетов;
	ДокументСчет.ВалютаДокумента 	     = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ДокументСчет.ПодразделениеКомпании   = Объект.ПодразделениеКомпании;
	ДокументСчет.Автор 					 = Объект.Автор;
	ДокументСчет.КурсДокумента  		 = 1;
	ДокументСчет.ТипЦен = Справочники.ТипыЦен.НормативнаяЦена; 
	ДокументСчет.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг;

	ОплатаУслуга = Справочники.Номенклатура.НайтиПоНаименованию("Оплата комиссионного вознаграждения",Истина);
	Если ОплатаУслуга.Пустая() Тогда
		НовУслуга = Справочники.Номенклатура.СоздатьЭлемент();
		НовУслуга.УстановитьНовыйКод();
		НовУслуга.Наименование = "Оплата комиссионного вознаграждения";
		НовУслуга.Артикул = НовУслуга.Код;
		НовУслуга.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга;
		НовУслуга.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Услуга;
		НовУслуга.БазоваяЕдиницаИзмерения = НовУслуга.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения;
		
		НовУслуга.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		НовУслуга.ВалютаУчета = ДокументСчет.ВалютаДокумента;
		НовУслуга.СпособРаспределенияДопРасходов = Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы;
		НовУслуга.СтатьяДопРасходов=Справочники.СтатьиДоходовИРасходов.ПрочиеЗатраты;
		НовУслуга.Записать();
		ЕИ = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		ЕИ.Владелец = НовУслуга.Ссылка; 
		ЕИ.ЕдиницаПоКлассификатору = НовУслуга.БазоваяЕдиницаИзмерения;
		ЕИ.Наименование = НовУслуга.БазоваяЕдиницаИзмерения.Наименование;
		ЕИ.Коэффициент = 1;
		ЕИ.Записать();
		НовУслуга.ОсновнаяЕдиницаИзмерения = ЕИ.Ссылка;
		НовУслуга.Записать();
		ОплатаУслуга = НовУслуга.Ссылка;
	КонецЕсли;
	
	СтрТовар = ДокументСчет.Товары.Добавить();
	
	СтрТовар.Номенклатура = ОплатаУслуга;
	СтрТовар.Количество = 1;
	СтрТовар.Коэффициент = 1;
	СтрТовар.ЕдиницаИзмерения = ОплатаУслуга.ОсновнаяЕдиницаИзмерения;
	СтрТовар.Сумма = Объект.ВыданныеКредиты.Итог("СуммаВознаграждения");
	СтрТовар.Цена =  СтрТовар.Сумма;
	СтрТовар.СуммаВсего = СтрТовар.Сумма;
	ДокументСчет.Записать();
	Объект.СчетНаОплату = ДокументСчет.Ссылка;
	Записать();
	ОрганизацияПродавец              = Объект.Организация;
	БанкПолучателяПредставление      = Объект.Организация.ОсновнойБанковскийСчет.Банк;
	СчетПолучателяПредставление      = Объект.Организация.ОсновнойБанковскийСчет.НомерСчета;
	БИКБанкаПолучателя 				 = БанкПолучателяПредставление.Код;
	СчетБанкаПолучателяПредставление = БанкПолучателяПредставление.КоррСчет;
	ИНН 							 = ОрганизацияПродавец.ИНН;
	КПП 							 = ОрганизацияПродавец.КПП;
	ПредставлениеПоставщика 		 = ОрганизацияПродавец.Наименование;
	
	Макет = Документы.Renault_АктПоКредитам.ПолучитьМакет("Счет");
	
	ОбластьЗаголовокСчета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьЗаголовок 	  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПоставщик 	  = Макет.ПолучитьОбласть("Поставщик");
	ОбластьПокупатель 	  = Макет.ПолучитьОбласть("Покупатель");
	ОбластьШапкаТаблицы   = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока 		  = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого 		  = Макет.ПолучитьОбласть("Итого");
	ОбластьИтогоНДС 	  = Макет.ПолучитьОбласть("ИтогоНДС");
	ОбластьСуммаПрописью  = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьПодвалСчета 	  = Макет.ПолучитьОбласть("ПодвалСчета");
	
	ТаблДок = Новый ТабличныйДокумент;
	
	ТаблДок.АвтоМасштаб        = Истина;
	ТаблДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ОбластьЗаголовокСчета.Параметры.БанкПолучателяПредставление 	 = БанкПолучателяПредставление;
	ОбластьЗаголовокСчета.Параметры.БИКБанкаПолучателя 				 = БИКБанкаПолучателя;
	ОбластьЗаголовокСчета.Параметры.СчетБанкаПолучателяПредставление = СчетБанкаПолучателяПредставление;	
	ОбластьЗаголовокСчета.Параметры.СчетПолучателяПредставление 	 = СчетПолучателяПредставление;
	ОбластьЗаголовокСчета.Параметры.ИНН 							 = ИНН;
	ОбластьЗаголовокСчета.Параметры.КПП 							 = КПП;
	ОбластьЗаголовокСчета.Параметры.ПредставлениеПоставщика 		 = ПредставлениеПоставщика;
	
	Заголовок = "Счет № " + ДокументСчет.Номер + " от " + Формат(ТекущаяДата(), "ДЛФ=DD");
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = Заголовок;
	
	Поставщик  = ПолучитьДанныеОрганизации(ОрганизацияПродавец);
	Покупатель = ПолучитьДанныеКонтрагентаЮрФактАдрес(Объект.Контрагент);
	
	ОбластьПоставщик.Параметры.ПредставлениеПоставщика 		= Поставщик;
	ОбластьПокупатель.Параметры.ПредставлениеПолучателя 	= Покупатель;
	
	ТаблДок.Вывести(ОбластьЗаголовокСчета);
	ТаблДок.Вывести(ОбластьЗаголовок);
	ТаблДок.Вывести(ОбластьПоставщик);
	ТаблДок.Вывести(ОбластьПокупатель);
	ТаблДок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрока.Параметры.НомерСтроки = 1;
	ОбластьСтрока.Параметры.Товар = "Оплата комиссионного вознаграждения за " + Формат(Объект.ПериодС, "ДФ=ММММ") + " " + Формат(Объект.ПериодС, "ДФ=гггг") + " г.";
	
	СуммаВсего = Объект.ВыданныеКредиты.Итог("СуммаВознаграждения");
	ОбластьСтрока.Параметры.Цена = СуммаВсего;
	ОбластьСтрока.Параметры.Сумма = СуммаВсего;
	ТаблДок.Вывести(ОбластьСтрока);
	
	ОбластьИтого.Параметры.Всего = СуммаВсего;
	ТаблДок.Вывести(ОбластьИтого);
	
	// Трояновский К.Е. 15.02.2019 10:53:38 {
	// Закомментировано по DMSCOR-1087
	//Если ТекущаяДата() >= '20190101' Тогда
	//	СуммаНДС = СуммаВсего * 20 / 120;
	//Иначе
	//	СуммаНДС = СуммаВсего * 18 / 118;
	//КонецЕсли;
	СуммаНДС = СуммаВсего * ОплатаУслуга.СтавкаНДС.Ставка / (100 + ОплатаУслуга.СтавкаНДС.Ставка);
	// Трояновский К.Е. 15.02.2019 10:53:38 }
	ОбластьИтогоНДС.Параметры.НДС      = "В том числе НДС:";
	ОбластьИтогоНДС.Параметры.ВсегоНДС = Формат(СуммаНДС, "ЧДЦ=2");
	ТаблДок.Вывести(ОбластьИтогоНДС);
	
	ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + 1 + ", на сумму " + Renault_Advanced_ОбщегоНазначения.ФорматСумм(СуммаВсего, ДокументСчет.ВалютаДокумента);
	ОбластьСуммаПрописью.Параметры.ИтогоПрописью  = Renault_Advanced_ОбщегоНазначения.СформироватьСуммуПрописью(СуммаВсего, ДокументСчет.ВалютаДокумента);
	ТаблДок.Вывести(ОбластьСуммаПрописью);
	
	//Чтение значения для руководителя
	СтруктураОтбора=Новый Структура("Организация,Объект",Объект.Организация,Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(Объект.Дата,СтруктураОтбора);
	ФИОРуководителя=СтруктураСведений.Значение;
	//Чтение значения для главного бухгалтера
	СтруктураОтбора=Новый Структура("Организация,Объект",Объект.Организация,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(Объект.Дата,СтруктураОтбора);
	ФИОБухгалтера=СтруктураСведений.Значение;
	
	
	ОбластьПодвалСчета.Параметры.ФИОРуководителя = "(" + Renault_Advanced_ОбщегоНазначения.ФамилияИнициалыФизЛица(ФИОРуководителя) + ")";
	ОбластьПодвалСчета.Параметры.ФИОБухгалтера   = "(" + Renault_Advanced_ОбщегоНазначения.ФамилияИнициалыФизЛица(ФИОБухгалтера)   + ")";
	ТаблДок.Вывести(ОбластьПодвалСчета);
	
	ТаблДок.ОтображатьСетку     = Ложь;
	ТаблДок.ОтображатьЗаголовки = Ложь;
	ТаблДок.АвтоМасштаб         = Истина;
	
	
	
	Возврат ТаблДок;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеОрганизации(ТекОрганизация)
	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	КонтактнаяИнформация.Объект,
	  |	КонтактнаяИнформация.Представление КАК Адрес
	  |ИЗ
	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	  |ГДЕ
	  |	КонтактнаяИнформация.Объект = &Организация
	  |	И КонтактнаяИнформация.Вид = &ВидАдрес";
	  
	  	
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Запрос.УстановитьПараметр("ВидАдрес", Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда	
		Представление = ТекОрганизация.Наименование + ", " + Выборка.Адрес;
	Иначе 
		Представление = ТекОрганизация.Наименование;
	КонецЕсли;                                      		
	
	Возврат Представление;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеКонтрагентаЮрФактАдрес(Контрагент) 
	
	Результат = Новый Структура;
	
	Результат.Вставить("НаименованиеПолное"     , "");
	Результат.Вставить("НаименованиеКраткое"    , "");
	Результат.Вставить("ИНН"                    , "");
	Результат.Вставить("КПП"                    , "");
	Результат.Вставить("АдресОсновной"          , "");
	Результат.Вставить("ТелефонОсновной"        , "");
			
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Результат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	  |	Контрагенты.ИНН КАК ИНН,
	  |	Контрагенты.КПП КАК КПП,
	  |	Контрагенты.Наименование КАК НаименованиеКраткое,
	  |	Контрагенты.Ссылка
	  |ПОМЕСТИТЬ ВТОсновныеДанные
	  |ИЗ
	  |	Справочник.Контрагенты КАК Контрагенты
	  |ГДЕ
	  |	Контрагенты.Ссылка = &Контрагент
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	КонтактнаяИнформация.Объект,
	  |	КонтактнаяИнформация.Представление КАК Адрес
	  |ПОМЕСТИТЬ ВТАдрес
	  |ИЗ
	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	  |ГДЕ
	  |	КонтактнаяИнформация.Объект = &Контрагент
	  |	И КонтактнаяИнформация.Вид = &ВидАдрес
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	КонтактнаяИнформация.Объект,
	  |	КонтактнаяИнформация.Представление КАК Телефон
	  |ПОМЕСТИТЬ ВТТелефон
	  |ИЗ
	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	  |ГДЕ
	  |	КонтактнаяИнформация.Объект = &Контрагент
	  |	И КонтактнаяИнформация.Вид = &ВидТелефон
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТОсновныеДанные.НаименованиеПолное,
	  |	ВТОсновныеДанные.ИНН,
	  |	ВТОсновныеДанные.КПП,
	  |	ВТОсновныеДанные.НаименованиеКраткое,
	  |	ЕСТЬNULL(ВТТелефон.Телефон, """") КАК ТелефонОсновной,
	  |	ЕСТЬNULL(ВТАдрес.Адрес, 0) КАК АдресОсновной
	  |ИЗ
	  |	ВТОсновныеДанные КАК ВТОсновныеДанные
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдрес КАК ВТАдрес
	  |		ПО ВТОсновныеДанные.Ссылка = ВТАдрес.Объект
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТТелефон КАК ВТТелефон
	  |		ПО ВТОсновныеДанные.Ссылка = ВТТелефон.Объект";
	  
	  	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидАдрес", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Представление = "";
	
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.НаименованиеПолное, ", ", "");
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.ИНН,                ", ", "ИНН/КПП ");
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.КПП,                "/",  "");
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.АдресОсновной,      ", ", "");
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.ТелефонОсновной,    ", ", "тел.: ");
	
	Возврат Представление;
	
КонецФункции


&НаКлиенте
Процедура ОбновитьИтого()
	
	ИтогоКредит = Объект.ВыданныеКредиты.Итог("СуммаКредита");
	ИтогоВознаграждение = Объект.ВыданныеКредиты.Итог("СуммаВознаграждения");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыданныеКредитыСуммаКредитаПриИзменении(Элемент)
	
	ОбновитьИтого();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыданныеКредитыСуммаВознагражденияПриИзменении(Элемент)
	
	ОбновитьИтого();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИтого();
	
КонецПроцедуры
